In [2]:
# Basic Libraries ðŸ“š
import pandas as pd
import os
import sys

In [3]:
# Sum & Return duplicates, NaN & two empty spaces ðŸ”§ 

def data_explore(df):   
    duplicate_rows = df.duplicated().sum()
    nan_values = df.isna().sum()
    empty_spaces = df.eq(' ').sum()
    exploration = pd.DataFrame({"NaN": nan_values, "EmptySpaces": empty_spaces}) # New dataframe with the results
    print(f"There are {df.duplicated().sum()} duplicate rows. Also;")
    return exploration

In [4]:
#Construct my relative path
relative_path = "my-jobcation-path/01_data_mining_phase/raw_data/coworkings.csv"
relative_path2 = "my-jobcation-path/01_data_mining_phase/raw_data/campsites.csv"

#Change directory
os.chdir('C:\\Users\\Oscar\\Documents\\00_Ironhack\\P3_Final\\') #Change for your own directory

#Check directory
current_directory = os.getcwd()
print("Current working directory is:", current_directory)

Current working directory is: C:\Users\Oscar\Documents\00_Ironhack\P3_Final

In [5]:
#Construct absolute paths
coworkings_path = os.path.join(current_directory, relative_path)
campsites_path = os.path.join(current_directory, relative_path2)

In [6]:
#Coworkings reading
if os.path.exists(coworkings_path):
    try:
        # Try to read the Excel file
        data = pd.read_csv(coworkings_path)
        print("The file has been loaded successfully.")
        # Now you can work with the 'data' DataFrame
    except Exception as e:
        print("An error occurred while reading the file:", e)
else:
    print("The file does not exist at the specified path:", coworkings_path)

The file has been loaded successfully.

In [7]:
#Campsites reading
if os.path.exists(campsites_path):
    try:
        # Try to read the Excel file
        data2 = pd.read_csv(campsites_path)
        print("The file has been loaded successfully.")
        # Now you can work with the 'data' DataFrame
    except Exception as e:
        print("An error occurred while reading the file:", e)
else:
    print("The file does not exist at the specified path:", campsites_path)

The file has been loaded successfully.

In [8]:
# Dataframe Creation
df = data.copy()
df2 = data2.copy()

In [9]:
data_explore(df)

There are 0 duplicate rows. Also;

           NaN  EmptySpaces
Name         0            0
Address      0            0
City         0            0
Rating       0            0
Website      0            0
Schedule     0            0
Latitude     0            0
Longitude    0            0

In [10]:
data_explore(df2)

There are 0 duplicate rows. Also;

           NaN  EmptySpaces
Name         0            0
Address      0            0
City         0            0
Rating       0            0
Website      0            0
Schedule     0            0
Latitude     0            0
Longitude    0            0

In [33]:
unique_coworks = df["Name"].unique()
unique_campsites = df2["Name"].unique()

In [41]:
df["Name"].nunique()

1064

In [43]:
df.shape

(1671, 8)

In [45]:
df2.shape

(1900, 8)

In [47]:
df2["Name"].nunique()

959

In [55]:
df3 = pd.DataFrame(df['Name'])

In [57]:
df4 = pd.DataFrame(df2['Name'])

In [59]:
data_explore(df3)

There are 607 duplicate rows. Also;

      NaN  EmptySpaces
Name    0            0

In [61]:
data_explore(df4)

There are 941 duplicate rows. Also;

      NaN  EmptySpaces
Name    0            0